import { MarketingConfig } from "@/types";

export const marketingConfig: MarketingConfig = {
  mainNav: [
    {
      title: "特徴",
      href: "#features",
    },
    {
      title: "ブログ📚",
      href: "/blog",
    },
  ],
  techstack: [
    {
      title: "Next.js →",
      description:
        "Reactに基づいたフレームワークで、モダンなアプリ開発を大幅に効率化するための機能を提供しています",
      href: "https://nextjs.org/",
      svg: (
        <svg
          height="45"
          width="45"
          viewBox="0 0 512 512"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M386.399 35.508C217.06-64.061 1.885 57.55.012 253.882c-1.828 191.716 201.063 315.545 370.02 231.163L185.56 213.636v167.997c0 18.614-35.619 18.614-35.619 0V156.421c0-14.776 27.448-15.989 35.226-3.145L395.43 470.572c157.95-101.737 155.817-338.136-9.031-435.064zm-23.756 317.939L326.91 298.87V149.458c0-13.932 35.732-13.932 35.732 0v203.989z"
            fill="currentColor"
          />
        </svg>
      ),
    },
    {
      title: "Tailwind css →",
      description:
        "よりオリジナリティの高いデザインのWebサイトを作成可能なCSSフレームワークです。",
      href: "https://tailwindcss.com/",
      svg: (
        <svg
          height="45"
          width="45"
          viewBox="0 0 24 24"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M7 9.969q1-4.063 5-4.063c4 0 4.5 3.047 6.5 3.555q2 .508 3.5-1.524Q21 12 17 12c-4 0-4.5-3.047-6.5-3.555Q8.5 7.938 7 9.97m-5 6.094Q3 12 7 12c4 0 4.5 3.047 6.5 3.555q2 .507 3.5-1.524q-1 4.063-5 4.063c-4 0-4.5-3.047-6.5-3.555q-2-.508-3.5 1.524"
            fill="currentColor"
            fillRule="evenodd"
          />
        </svg>
      ),
    },
    {
      title: "shadcn/ui →",
      description:
        "モダンなウェブ開発環境において、UI構築を効率化するための便利なツールです。",
      href: "https://ui.shadcn.com/",
      svg: (
        <svg
          height="45"
          width="45"
          viewBox="0 0 24 24"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M22.219 11.784L11.784 22.219a1.045 1.045 0 0 0 1.476 1.476L23.695 13.26a1.045 1.045 0 0 0-1.476-1.476M20.132.305L.305 20.132a1.045 1.045 0 0 0 1.476 1.476L21.608 1.781A1.045 1.045 0 0 0 20.132.305"
            fill="currentColor"
          />
        </svg>
      ),
    },
    {
      title: "Prisma →",
      description:
        "Node.jsやTypeScript環境向けに設計された次世代ORMおよびデータベースツールキットです。",
      href: "https://www.prisma.io/",
      svg: (
        <svg
          height="45"
          width="45"
          viewBox="0 0 24 24"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M21.807 18.285L13.553.756a1.324 1.324 0 0 0-1.129-.754a1.31 1.31 0 0 0-1.206.626l-8.952 14.5a1.356 1.356 0 0 0 .016 1.455l4.376 6.778a1.408 1.408 0 0 0 1.58.581l12.703-3.757c.389-.115.707-.39.873-.755s.164-.783-.007-1.145zm-1.848.752L9.18 22.224a.452.452 0 0 1-.575-.52l3.85-18.438c.072-.345.549-.4.699-.08l7.129 15.138a.515.515 0 0 1-.325.713z"
            fill="currentColor"
          />
        </svg>
      ),
    },
    {
      title: "Supabase →",
      description:
        "オープンソースのBaaSプラットフォームで、Firebaseの代替として注目されています。",
      href: "https://supabase.com/",
      svg: (
        <svg
          height="45"
          width="45"
          viewBox="0 0 24 24"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M11.9 1.036c-.015-.986-1.26-1.41-1.874-.637L.764 12.05C-.33 13.427.65 15.455 2.409 15.455h9.579l.113 7.51c.014.985 1.259 1.408 1.873.636l9.262-11.653c1.093-1.375.113-3.403-1.645-3.403h-9.642z"
            fill="currentColor"
          />
        </svg>
      ),
    },
    {
      title: "Clerk →",
      description:
        "Webアプリやモバイルアプリに「認証（ログイン/登録）」機能を簡単に追加できるサービスです。",
      href: "https://next-auth.js.org/",
      svg: (
        <svg
          height="45"
          width="45"
          viewBox="0 0 24 24"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="m21.47 20.829l-2.881-2.881a.572.572 0 0 0-.7-.084a6.854 6.854 0 0 1-7.081 0a.576.576 0 0 0-.7.084l-2.881 2.881a.576.576 0 0 0-.103.69a.57.57 0 0 0 .166.186a12 12 0 0 0 14.113 0a.58.58 0 0 0 .239-.423a.576.576 0 0 0-.172-.453m.002-17.668l-2.88 2.88a.569.569 0 0 1-.701.084A6.857 6.857 0 0 0 8.724 8.08a6.862 6.862 0 0 0-1.222 3.692a6.86 6.86 0 0 0 .978 3.764a.573.573 0 0 1-.083.699l-2.881 2.88a.567.567 0 0 1-.864-.063A11.993 11.993 0 0 1 6.771 2.7a11.99 11.99 0 0 1 14.637-.405a.566.566 0 0 1 .232.418a.57.57 0 0 1-.168.448m-7.118 12.261a3.427 3.427 0 1 0 0-6.854a3.427 3.427 0 0 0 0 6.854"
            fill="currentColor"
          />
        </svg>
      ),
    },
    {
      title: "zod →",
      description:
        "TypeScriptファーストのスキーマ宣言およびバリデーションライブラリです。",
      href: "https://zod.dev/",
      svg: (
        <svg
          height="45"
          width="45"
          viewBox="0 0 24 24"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M19.088 2.477L24 7.606L12.521 20.485l-.925 1.038L0 7.559l5.108-5.082h13.98Zm-17.434 5.2l6.934-4.003H5.601L1.619 7.636l.035.041Zm12.117-4.003L3.333 9.7l2.149 2.588l10.809-6.241l-.2-.346l2.851-1.646l-.365-.381h-4.806Zm7.52 2.834L8.257 14.034h5.101v-.4h3.667l5.346-5.998l-1.08-1.128Zm-7.129 10.338H9.268l2.36 2.843l2.534-2.843Z"
            fill="currentColor"
          />
        </svg>
      ),
    },
    {
      title: "Editor.js →",
      description:
        "ブロックベースの構造を持つオープンソースのWYSIWYGエディタで、JSON形式でデータを管理できるのが特徴です。",
      href: "https://editorjs.io/",
      svg: (
        <svg
          height="45"
          width="45"
          viewBox="0 0 1024 1024"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M512 0C229.232 0 0 229.232 0 512c0 282.784 229.232 512 512 512c282.784 0 512-229.216 512-512C1024 229.232 794.784 0 512 0zm0 961.008c-247.024 0-448-201.984-448-449.01c0-247.024 200.976-448 448-448s448 200.977 448 448s-200.976 449.01-448 449.01zM736 480H544V288c0-17.664-14.336-32-32-32s-32 14.336-32 32v192H288c-17.664 0-32 14.336-32 32s14.336 32 32 32h192v192c0 17.664 14.336 32 32 32s32-14.336 32-32V544h192c17.664 0 32-14.336 32-32s-14.336-32-32-32z"
            fill="currentColor"
          />
        </svg>
      ),
    },
  ],
};
